In [3]:
import pandas as pd

In [4]:
url = 'https://raw.githubusercontent.com/piotrgradzinski/dap_20230114/main/day_6_pgg/emps.csv'
emps = pd.read_csv(url, sep=';', encoding='utf-8', index_col='employee_id', parse_dates=['hire_date'])
emps.head(4)

,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
employee_id,,,,,,,,,,
100,Steven,King,President,24000,1997-06-17,Executive,2004 Charade Rd,98199,Seattle,United States of America
101,Neena,Kochhar,Administration Vice President,17000,1999-09-21,Executive,2004 Charade Rd,98199,Seattle,United States of America
102,Lex,De Haan,Administration Vice President,17000,2003-01-13,Executive,2004 Charade Rd,98199,Seattle,United States of America
103,Alexander,Hunold,Programmer,9000,2000-01-03,IT,2014 Jabberwocky Rd,26192,Southlake,United States of America

# Exercises

List employees from Seattle with column: first_name,last_name, salary and city

In [ ]:
emps[emps.city=='Seatte'].loc[:,['first_name', 'last_name', 'salary']]

Empty DataFrame
Columns: [first_name, last_name, salary]
Index: []

Using `iloc` get `0 first employeees from Oxford

In [ ]:
emps[emps.city=='Oxford'].iloc[:10, 0:2]

In [7]:
emps[emps.city=='Oxford'].iloc[:10].salary.mean()

10500.0

In [6]:
emps[emps.city=='Oxford'].head(10).salary.mean()

10500.0